{"name":"Bruce Nshuti","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Bruce Nshuti- curious","headerTaglineThree":"designer and Developer","headerTaglineFour":" based in Kigali Rwanda","showCursor":true,"showBlog":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/06bruce"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/nshuti-bruce-b74150266/"},{"id":"3","title":"Twitter","link":"https://x.com/bruce96083"},{"id":"5","title":"Email","link":"mailto:brucenshuti2@gmail.com"}],"projects":[{"id":"1","title":"Smart Dot Com Elctronics","description":"Smart Dot Com Electronics is an innovative electronics company specializing in high-quality consumer gadgets and smart devices. Committed to cutting-edge technology and user-friendly design, Smart Dot Co delivers reliable and affordable electronics that enhance everyday life.","imageSrc":"https://smartdotcomelectronics.com/front/images/watches/IMG-20250520-WA0056.jpg","url":"https://smartdotcomelectronics.com/"},{"id":"2","title":"New Army Portal ","description":"A high-security Web3-powered platform designed for military and police recruitment. Built using FastAPI, MongoDB, React, and blockchain technology, the system enables secure citizen registration, digital document submission, and direct communication with RDF and RNP officers—eliminating the need for in-person visits while ensuring data integrity and access control.","imageSrc":"https://www.mod.gov.rw/index.php?eID=dumpFile&t=p&p=306038&token=48ddea7679662f80a984d813245844c4a8647030","url":"Comming Soon"},{"id":"3","title":"7 Areas of Influence Digital Platform","description":"The 7 Mountains Project is a purpose-driven initiative focused on building digital tools that empower leaders to impact key areas of society—Faith, Family, Education, Government, Media, Arts, and Business. Through secure and scalable tech solutions, this project aims to inspire positive change across all spheres of influence.","imageSrc":"https://7mountains.vercel.app/img/WMHS2-min.jpg","url":"https://7mountains.vercel.app/"},{"id":"4","title":"Advanced Ecommerce Platform","description":"An advanced Laravel-based application featuring robust CRUD operations, user authentication, and an intuitive admin dashboard. Built with a focus on security, scalability, and clean code, this project streamlines data management and enhances user experience through efficient backend and frontend integration.","imageSrc":"https://www.simform.com/wp-content/uploads/2020/08/eCommerce_website_features_cost.png","url":"Coming Soon"}],"services":[{"id":"1","title":"Website Development","description":"I develop responsive and user-friendly websites using frameworks like React, Laravel, and Node.js. I build secure backend systems, work with databases like MongoDB and MySQL, and ensure websites perform smoothly. I also handle deployment and collaborate with teams to deliver quality projects"},{"id":"2","title":"Branding","description":"I create strong and memorable brand identities by designing logos, selecting color schemes, and crafting consistent visual styles. I help businesses communicate their values clearly and build a professional image that stands out.\n\n"},{"id":"3","title":"Web Design","description":"We build and optimize your online presence.  Website is the digital entry point into your business and a powerful revenue channel."},{"id":"4","title":"3D Design","description":"We combine creative design and technical skills to build striking 3D visualisations that bring your project to life."}],"aboutpara":"Nshuti Bruce is a results-driven full-stack software developer with hands-on experience in building secure, scalable applications using technologies like Laravel, React, Node.js, MongoDB, and FastAPI. He has contributed to projects ranging from military registration systems and IoT solutions to authentication platforms and responsive user dashboards.\n\nBruce is known for his consistent performance, attention to detail, and strong integrity. He approaches every task with professionalism and a deep sense of responsibility—delivering clean code, respecting deadlines, and maintaining high ethical standards in both solo and team settings.\n\nWith a solid foundation in cybersecurity, web development, and backend engineering, Bruce continues to grow as a trustworthy and capable developer who brings value, security, and honesty to every project.","resume":{"tagline":"👋  I'm a software developer, project manager.","description":"I’ve taught Nshuti Bruce and can say he’s a focused, respectful, and talented student. He works hard, learns fast, and always shows honesty in everything he does. I fully trust his skills and character. \"Bruce's Python Professor Said\"","experiences":[{"id":"1","dates":"March 2025- Present","type":"Full Time","position":"Ecommerce Platform Developer","bullets":"Bullet One, Bullet Two"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"July 2023- Sept - 2024","type":"Full Time","position":"Website Developer (Owner)","bullets":"Worked on the frontend of a React application, Worked on the frontend of a React application"}],"education":{"universityName":"High School","universityDate":"2024-2026","universityPara":"Got it! Here’s a slightly longer version—around 2.5 lines:  ---  The frontend of 7mountains.vercel.app is clean and modern with a smooth, responsive layout. It’s easy to navigate, visually balanced, and looks great on both desktop and mobile devices."},"languages":["Javascript","HTML5","CSS","Python","Go"],"frameworks":["React","Typescript","NodeJs"],"others":["Figma","AdobeXD","AWS"]}}